Repository: debuggerdev24/Astrology_Mobile_App
Catalog: lib/l10n/app_*.arb
Languages: ta

source: Settings
ta: அமைப்புகள்

source: Profile
ta: சுயவிவரம்

source: App Info
ta: பயன்பாட்டு தகவல்

source: Notification
ta: அறிவிப்புகள்

source: Subscription
ta: சந்தா

source: Privacy Policy
ta: தனியுரிமைக் கொள்கை

source: Spiritual Disclaimers
ta: ஆன்மீக மறுப்புகள்

source: FAQs
ta: அடிக்கடி கேட்கப்படும் கேள்விகள்

# termsAndConditions
source: Terms & Conditions
ta: விதிமுறைகளும் நிபந்தனைகளும்

source: Full Name
ta: முழு பெயர்

source: Good Morning
ta: காலை வணக்கம்

source: See All
ta: பார்வை

source: Dasha
ta: தாஷா

source: Moon Sign
ta: சந்திரன் அடையாளம்

source: Daily Mantra
ta: தினசரி மந்திரம்

source: Home
ta: முகப்புப் பக்கம்

source: Mantras
ta: மந்திரங்கள்

source: Remedies
ta: வைத்தியம்

source: Consult
ta: ஆலோசனை

source: View Detailed Reading
ta: விரிவான வாசிப்பைக் காண்க

source: Daily Mantra Log
ta: தினசரி மந்திரப் பதிவு

source: Please upload your palm image first.
ta: முதலில் உங்கள் உள்ளங்கைப் படத்தைப் பதிவேற்றவும்.

source: Left Hand
ta: இடது கை

source: Right Hand
ta: வலது கை

source: Submit For Reading
ta: படிக்க சமர்ப்பிக்கவும்

# uploadImageScreenPara
source: Your personalized palm reading will only be generated after uploading your palm photo. Once the analysis is complete, tailored remedies will be suggested based on your palm and horoscope alignment.
ta: உங்கள் உள்ளங்கை புகைப்படத்தைப் பதிவேற்றிய பின்னரே உங்கள் தனிப்பயனாக்கப்பட்ட உள்ளங்கை அளவீடு உருவாக்கப்படும். பகுப்பாய்வு முடிந்ததும், உங்கள் உள்ளங்கை மற்றும் ஜாதக சீரமைப்பின் அடிப்படையில் தனிப்பயனாக்கப்பட்ட தீர்வுகள் பரிந்துரைக்கப்படும்.

source: Palm Reading
ta: கைரேகை வாசிப்பு

source: Summary
ta: சுருக்கம்

source: Mount Analysis
ta: மவுண்ட் பகுப்பாய்வு

source: Life Line
ta: வாழ்க்கைக் கோடு

source: Head Line
ta: தலைப்பு வரி

source: Heart Line
ta: இதயக் கோடு

source: Mount Of Jupiter
ta: வியாழன் மலை

source: Mount Of Venus
ta: வீனஸ் மலை

source: View Remedies
ta: தீர்வுகளைக் காண்க

source: Match With Birth Cart
ta: பிறப்பு விளக்கப்படத்துடன் பொருத்தம்

source: View Details
ta: விவரங்களைப் பார்

source: Type
ta: வகை

source: Description
ta: விளக்கம்

source: Planet
ta: கிரகம்

source: Birth Chart
ta: பிறப்பு ஜாதகம்

source: Birth Chart Summary
ta: பிறப்பு விளக்கப்படம் சுருக்கம்

source: Palm Reading Summary
ta: பனை வாசிப்பு சுருக்கம்

source: Interpretation
ta: விளக்கம்

source: Active
ta: செயலில்

source: Moon in Pisces
ta: மீன ராசியில் சந்திரன்

source: Meaning
ta: பொருள்

# suggestedAction
source: Suggested Actions
ta: பரிந்துரைக்கப்பட்ட செயல்கள்

source: Text Instruction
ta: உரை வழிமுறை

source: Spiritual Meaning
ta: ஆன்மீக அர்த்தம்

source: Set Reminder
ta: நினைவூட்டலை அமைக்கவும்

source: Reminder Title
ta: நினைவூட்டல் தலைப்பு

# reminderTitleHintText
source: Morning Pooja for Mars Remedy
ta: செவ்வாய் தோஷ பரிகாரத்திற்கான காலை பூஜை

source: Daily
ta: தினசரி

source: Weekly
ta: வாராந்திர

source: Monthly
ta: மாதாந்திர

source: Custom
ta: தனிப்பயன்

# selectDateAndTime
source: Select Date & Time
ta: தேதி & நேரத்தைத் தேர்ந்தெடுக்கவும்

source: Save Reminder
ta: நினைவூட்டலைச் சேமி

source: Download
ta: பதிவிறக்கவும்

source: Share
ta: பகிர்

source: Choose Your Plan
ta: உங்கள் திட்டத்தைத் தேர்வுசெய்யவும்

source: Free
ta: இலவசம்

source: Basic Horoscope
ta: அடிப்படை ஜாதகம்

source: Daily Tips
ta: தினசரி குறிப்புகள்

source: Tier
ta: அடுக்கு

source: Daily Mantras
ta: தினசரி மந்திரங்கள்

source: History Access
ta: வரலாற்று அணுகல்

source: Basic Remedies
ta: அடிப்படை வைத்தியம்

source: Month
ta: மாதம்

source: Months
ta: மாதங்கள்

source: Choose Plan
ta: திட்டத்தைத் தேர்வுசெய்க

source: Palmistry
ta: கைரேகை சாஸ்திரம்

source: Birth Chart Matching
ta: பிறப்பு விளக்கப்பட பொருத்தம்

source: Detailed Remedies
ta: விரிவான வைத்தியங்கள்

source: Consult Booking
ta: முன்பதிவை ஆலோசிக்கவும்

source: All features unlocked
ta: அனைத்து அம்சங்களும் திறக்கப்பட்டன

source: Advanced
ta: மேம்பட்டது

source: Elite
ta: எலைட்

source: Cancel
ta: ரத்துசெய்

# payAndSubscribe
source: Pay & Subscribe
ta: பணம் செலுத்தி குழுசேருங்கள்

source: Upgrade Plan
ta: மேம்படுத்தல் திட்டம்

source: Purchase Plan
ta: கொள்முதல் திட்டம்

source: Choose Payment Method
ta: கட்டண முறையைத் தேர்வுசெய்யவும்

source: Pay Now
ta: இப்போதே பணம் செலுத்துங்கள்.

source: Payment Confirmation
ta: கட்டண உறுதிப்படுத்தல்

source: Payment Failed!
ta: பணம் செலுத்த முடியவில்லை

source: Payment Was Successful
ta: பணம் செலுத்தப்பட்டது

source: Payment Was Failed
ta: பணம் செலுத்த முடியவில்லை.

source: Thanks
ta: நன்றி

source: Done
ta: முடிந்தது

source: Try Again
ta: மீண்டும் முயற்சிக்கவும்

source: Price
ta: விலை

source: Subscription Date
ta: சந்தா தேதி

source: Subscription Validity
ta: சந்தா செல்லுபடியாகும் காலம்

source: Date Of Birth
ta: பிறந்த தேதி

source: Time Of Birth
ta: பிறந்த நேரம்

source: Place of Birth
ta: பிறந்த இடம்

source: Current Location
ta: தற்போதைய இடம்

source: Current Subscription
ta: தற்போதைய சந்தா

source: Uploaded Palm
ta: பதிவேற்றப்பட்ட உள்ளங்கை

source: Upload Palm
ta: உள்ளங்கையைப் பதிவேற்று

source: Check Your Current Plan
ta: உங்கள் தற்போதைய திட்டத்தைச் சரிபார்க்கவும்

source: Log Out
ta: வெளியேறு

source: Save
ta: சேமிக்கவும்

# checkBoxWarningMessage
source: Please check the box to agree to the terms and continue.
ta: விதிமுறைகளை ஏற்றுக்கொண்டு தொடர பெட்டியைத் தேர்வுசெய்யவும்.

# internetConnectionMessage
source: Unable to connect. Please check your internet connection.
ta: இணைக்க முடியவில்லை. உங்கள் இணைய இணைப்பைச் சரிபார்க்கவும்.

# noChangesFoundMessage
source: No updates found. Please make changes before saving.
ta: புதுப்பிப்புகள் எதுவும் இல்லை. சேமிப்பதற்கு முன் மாற்றங்களைச் செய்யவும்.

source: Profile Updated Successfully
ta: சுயவிவரம் வெற்றிகரமாகப் புதுப்பிக்கப்பட்டது.

source: Please enter palm image
ta: உள்ளங்கைப் படத்தை உள்ளிடவும்.

source: is required
ta: அவசியம்

# nameSyntaxError
source: Enter a valid name (Only alphabets allowed)!
ta: செல்லுபடியாகும் பெயரை உள்ளிடவும் (எழுத்துக்கள் மட்டுமே அனுமதிக்கப்படும்)!

# emailSyntaxError
source: Enter a valid Email!
ta: செல்லுபடியாகும் மின்னஞ்சலை உள்ளிடவும்!

# accNotFoundError
source: No account found with this email. Please try again or sign up!
ta: இந்த மின்னஞ்சலில் எந்தக் கணக்கும் இல்லை. மீண்டும் முயற்சிக்கவும் அல்லது பதிவு செய்யவும்!

source: Birth Place
ta: பிறந்த இடம்

source: Enter your Full Name
ta: உங்கள் முழுப் பெயரை உள்ளிடவும்

# enterYourBirthDate
source: Enter your DOB
ta: உங்கள் பிறந்த தேதியை உள்ளிடவும்

# enterYourBirthTime
source: Enter your TOB
ta: உங்கள் பிறந்த நேரத்தை உள்ளிடவும்

source: Enter your Birth Place
ta: உங்கள் பிறந்த இடத்தை உள்ளிடவும்

source: Enter your Current Location
ta: உங்கள் தற்போதைய இருப்பிடத்தை உள்ளிடவும்

source: Repeat Frequency
ta: மீண்டும் நிகழும் அதிர்வெண்

source: Monday
ta: திங்கள்

source: Tuesday
ta: செவ்வாய்

source: Wednesday
ta: புதன்கிழமை

source: ThursDay
ta: வியாழன்

source: Friday
ta: வெள்ளி

source: Saturday
ta: சனிக்கிழமை

source: Sunday
ta: ஞாயிற்றுக்கிழமை

source: Time
ta: நேரம்

source: Select Time
ta: நேரத்தைத் தேர்ந்தெடுக்கவும்

source: Karma Focus
ta: கர்ம கவனம்

source: Action
ta: செயல்

source: Caution
ta: எச்சரிக்கை

source: Your ruling planet today
ta: இன்று உங்களை ஆளும் கிரகம்

source: Nakshatra
ta: நட்சத்திரம்

source: Insights
ta: நுண்ணறிவுகள்

# logOutConfirmation
source: Are you sure you want to Log Out?
ta: நீங்கள் நிச்சயமாக வெளியேற விரும்புகிறீர்களா?

source: Yes
ta: ஆம்

# noMantraToday
source: No mantra scheduled for today
ta: இன்று எந்த மந்திரமும் திட்டமிடப்படவில்லை.

source: Date
ta: தேதி

source: Select Date
ta: தேதியைத் தேர்ந்தெடுக்கவும்

source: Career
ta: தொழில்

source: Relationships
ta: உறவுகள்

source: Health
ta: சுகாதாரம்

source: Finance
ta: நிதி

source: Spirituality
ta: ஆன்மீகம்

source: Mount Of Saturn
ta: சனி கிரகத்தின் மலை

source: Mount Of Sun
ta: சூரிய மலை

source: Upgrade Now
ta: அபி அபகிரட்

source: Premium Access
ta: பிரீமியம் அணுகல்

# premiumMessageMountAnalysis
source: To view detailed Mount Analysis, please upgrade to a Premium Plan (Tier 2).
ta: விரிவான மவுண்ட் பகுப்பாய்வைப் பார்க்க, தயவுசெய்து பிரீமியம் திட்டத்திற்கு (நிலை 2) மேம்படுத்தவும்.

# premiumMessageMatchWithBirthChart
source: The "Match with Birth Chart" feature is available exclusively for Premium Plan (Tier 2) users.
ta: "பிறப்பு விளக்கப்படத்துடன் பொருத்து" அம்சம் பிரீமியம் திட்டம் (நிலை 2) பயனர்களுக்கு மட்டுமே கிடைக்கிறது.

# premiumMessageMatchWithRemedies
source: The "Remedies" feature is available exclusively for Premium Plan (Tier 2) users.
ta: "வைத்தியம்" அம்சம் பிரீமியம் திட்டம் (நிலை 2) பயனர்களுக்கு மட்டுமே கிடைக்கிறது.

# premiumSloganMessageMountAnalysis
source: Unlock personalized insights into your palm’s mounts and their influence on your life path.
ta: உங்கள் உள்ளங்கையின் உயரங்கள் மற்றும் உங்கள் வாழ்க்கைப் பாதையில் அவற்றின் செல்வாக்கு பற்றிய தனிப்பயனாக்கப்பட்ட நுண்ணறிவுகளைத் திறக்கவும்.

# premiumSloganMessageMatchWithBirthChart
source: The "Match with Birth Chart" feature is available exclusively for Premium Plan (Tier 2) users.
ta: "பிறப்பு விளக்கப்படத்துடன் பொருத்து" அம்சம் பிரீமியம் திட்டம் (நிலை 2) பயனர்களுக்கு மட்டுமே கிடைக்கிறது.

# premiumSloganMessageRemedies
source: The "Remedies" feature is available exclusively for Premium Plan (Tier 2) users.
ta: உங்கள் உள்ளங்கையின் உயரங்கள் மற்றும் உங்கள் வாழ்க்கைப் பாதையில் அவற்றின் செல்வாக்கு பற்றிய தனிப்பயனாக்கப்பட்ட நுண்ணறிவுகளைத் திறக்கவும்.

# premiumMantraHistory
source: Unlock mantra history and track your spiritual journey
ta: மந்திர வரலாற்றைத் திறந்து உங்கள் ஆன்மீக பயணத்தைக் கண்காணிக்கவும்

source: Upgrade to Tier 1
ta: நிலை 1 க்கு மேம்படுத்தவும்

source: Sign Up
ta: பதிவு செய்

# signUpSlogan
source: Unlock personalized astrological insights just for you.
ta: உங்களுக்காகவே தனிப்பயனாக்கப்பட்ட ஜோதிட நுண்ணறிவுகளைத் திறக்கவும்.

source: Name
ta: பெயர்

source: Email
ta: மின்னஞ்சல்

source: Password
ta: கடவுச்சொல்

source: Confirm Password
ta: கடவுச்சொல்லை உறுதிப்படுத்தவும்

# alreadyHaveAcc
source: Already have an account?
ta: ஏற்கனவே ஒரு கணக்கு உள்ளதா?

source: Sign In
ta: உள்நுழை

# signInSlogan
source: Reconnect with your cosmic journey.
ta: உங்கள் பிரபஞ்சப் பயணத்துடன் மீண்டும் இணையுங்கள்.

# forgotPass
source: Forgot Password
ta: கடவுச்சொல் மறந்துவிட்டது

# dontHaveAcc
source: Don"t have an account?
ta: கணக்கு இல்லையா?

# forgotPassSlogan
source: Even stars lose their way — let's help you reset yours.
ta: நட்சத்திரங்கள் கூட வழி தவறுகின்றன - உங்களுடையதை மீட்டமைக்க உதவுவோம்.

source: Send Mail
ta: அஞ்சல் அனுப்பு

# enterCode
source: Enter 4-Digit Code
ta: 4-இலக்க குறியீட்டை உள்ளிடவும்

# otpVerifySlogan
source: Verify your energy with the stars — enter the code.
ta: நட்சத்திரங்களுடன் உங்கள் ஆற்றலைச் சரிபார்க்கவும் - குறியீட்டை உள்ளிடவும்.

source: Verify
ta: சரிபார்க்கவும்

source: Resend OTP
ta: OTP-ஐ மீண்டும் அனுப்பு

source: Resend OTP in
ta: மீண்டும் அனுப்பு

source: Reset Password
ta: கடவுச்சொல்லை மீட்டமைக்க

source: New Password
ta: புதிய கடவுச்சொல்

source: Enter Your Name
ta: உங்கள் பெயரை உள்ளிடவும்

source: Enter Your Email
ta: உங்கள் மின்னஞ்சலை உள்ளிடவும்

source: Enter Your Password
ta: உங்கள் கடவுச்சொல்லை உள்ளிடவும்

source: Enter Your Confirm Password
ta: உங்கள் உறுதிப்படுத்தல் கடவுச்சொல்லை உள்ளிடவும்.

# enterYourNewPass
source: Enter Your New Password
ta: உங்கள் புதிய கடவுச்சொல்லை உள்ளிடவும்

# enterYourResetPass
source: Enter Your Reset Password
ta: உங்கள் மீட்டமைப்பு கடவுச்சொல்லை உள்ளிடவும்

source: Add New Palm
ta: புதிய பனையைச் சேர்க்கவும்

source: Add
ta: சேர்

source: Warning
ta: எச்சரிக்கை

# warnMessage
source: If you add a new palm, the existing data will be lost.
ta: நீங்கள் ஒரு புதிய உள்ளங்கையைச் சேர்த்தால், ஏற்கனவே உள்ள தரவு இழக்கப்படும்.

source: Good Afternoon
ta: மதிய வணக்கம்

source: Good Evening
ta: மாலை வணக்கம்

# choosePrefLang
source: Choose your preferred language
ta: உங்களுக்கு விருப்பமான மொழியைத் தேர்வுசெய்யவும்

source: Confirm
ta: உறுதிப்படுத்தவும்

# selectLang
source: Select Language
ta: மொழியைத் தேர்ந்தெடுங்கள்

source: Registered successfully
ta: வெற்றிகரமாகப் பதிவுசெய்யப்பட்டது

source: Login successfully
ta: வெற்றிகரமாக உள்நுழைந்தேன்

source: Logged out successfully
ta: வெற்றிகரமாக வெளியேறிவிட்டீர்கள்

source: Family Energy
ta: குடும்ப சக்தி

source: Power Periods
ta: சக்தி காலங்கள்

source: Emotional Energy
ta: உணர்ச்சி ஆற்றல்

source: Learning Outlook
ta: கற்றல் அவுட்லுக்

source: Spiritual Energy
ta: ஆன்மீக ஆற்றல்

source: Planetary Snapshot
ta: கோள்களின் புகைப்படம்

source: OTP sent successfully
ta: OTP வெற்றிகரமாக அனுப்பப்பட்டது

source: OTP resent successfully
ta: OTP வெற்றிகரமாக அனுப்பப்பட்டது

source: OTP verified successfully
ta: OTP வெற்றிகரமாக சரிபார்க்கப்பட்டது

source: Password reset successfully
ta: கடவுச்சொல் வெற்றிகரமாக மீட்டமைக்கப்பட்டது.

source: Daily Reminder Created
ta: தினசரி நினைவூட்டல் உருவாக்கப்பட்டது.

source: Weekly Reminder Created
ta: வாராந்திர நினைவூட்டல் உருவாக்கப்பட்டது.

source: Monthly Reminder Created
ta: மாதாந்திர நினைவூட்டல் உருவாக்கப்பட்டது.

source: Custom Reminder Created
ta: தனிப்பயன் நினைவூட்டல் உருவாக்கப்பட்டது.

source: Downloaded Successfully.
ta: வெற்றிகரமாக பதிவிறக்கம் செய்யப்பட்டது.

# confirmPassShouldMatch
source: Confirm Password should match with Password!
ta: கடவுச்சொல் கடவுச்சொல்லுடன் பொருந்த வேண்டும் என்பதை உறுதிப்படுத்தவும்!

# confirmPasswordForValidation
source: Confirm Password
ta: கடவுச்சொல்லை உறுதிப்படுத்தவும்

# passwordSyntaxError
source: Password must be at least 8 characters, include a capital letter, a number, and a special character!
ta: கடவுச்சொல்லில் குறைந்தது 8 எழுத்துகள் இருக்க வேண்டும், அதில் ஒரு பெரிய எழுத்து, ஒரு எண் மற்றும் ஒரு சிறப்பு எழுத்து ஆகியவை அடங்கும்!

# expireToken
source: Token has expired
ta: டோக்கன் காலாவதியாகிவிட்டது.

# noMantraHistory
source: No mantra history available.
ta: மந்திர வரலாறு எதுவும் கிடைக்கவில்லை.

source: Palm + Birth Chart Alignment
ta: உள்ளங்கை + பிறப்பு விளக்கப்பட சீரமைப்பு

# agreementDetails
source: This app offers spiritual guidance and is not a substitute for professional advice. By continuing, you accept the terms of use and privacy policy.
ta: இந்த ஆப் ஆன்மீக வழிகாட்டுதலை வழங்குகிறது மற்றும் தொழில்முறை ஆலோசனைக்கு மாற்றாக இல்லை. தொடர்வதன் மூலம், நீங்கள் பயன்பாட்டு விதிமுறைகள் மற்றும் தனியுரிமைக் கொள்கையை ஏற்றுக்கொள்கிறீர்கள்.

# understandAndAgree
source: I understand and agree.
ta: நான் புரிந்துகொண்டு ஒப்புக்கொள்கிறேன்.

# continueText
source: Continue
ta: தொடரவும்

source: Next
ta: அடுத்து

# mantraSectionTutorial
source: Listen to daily mantras and keep your mind calm. Tap on a mantra’s text or audio icon to open the full audio screen.
ta: தினசரி மந்திரங்களைக் கேட்டு உங்கள் மனதை அமைதியாக வைத்திருங்கள். முழு ஆடியோ திரையைத் திறக்க மந்திரத்தின் உரை அல்லது ஆடியோ ஐகானைத் தட்டவும்.

# palmSectionTutorial
source: Capture both your palms and reflect on your life balance — observe your lines, focus on mindfulness, and understand yourself better.
ta: உங்கள் இரு உள்ளங்கைகளையும் பிடித்து உங்கள் வாழ்க்கை சமநிலையைப் பற்றி சிந்தியுங்கள் - உங்கள் கோடுகளைக் கவனியுங்கள், நினைவாற்றலில் கவனம் செலுத்துங்கள், உங்களை நன்றாகப் புரிந்து கொள்ளுங்கள்.

# premiumDialogTutorial
source: This is the Premium Access dialog. Upgrade to unlock advanced features like Mount Analysis and Birth Chart matching.
ta: இது பிரீமியம் அணுகல் உரையாடல். மவுண்ட் பகுப்பாய்வு மற்றும் பிறப்பு விளக்கப்பட பொருத்தம் போன்ற மேம்பட்ட அம்சங்களைத் திறக்க மேம்படுத்தவும்.

# remedySectionTutorial
source: Know how planets, dasha, and their energies influence your palm. Discover their effects and remedies — unlock Premium Access for deeper insights.
ta: கிரகங்கள், தசா மற்றும் அவற்றின் சக்திகள் உங்கள் உள்ளங்கையை எவ்வாறு பாதிக்கின்றன என்பதை அறிந்து கொள்ளுங்கள். அவற்றின் விளைவுகள் மற்றும் தீர்வுகளைக் கண்டறியவும் - ஆழமான நுண்ணறிவுகளுக்கு பிரீமியம் அணுகலைத் திறக்கவும்.

# profileSectionTutorial
source: Add your personal details and secure your account in the app.
ta: உங்கள் தனிப்பட்ட விவரங்களைச் சேர்த்து, பயன்பாட்டில் உங்கள் கணக்கைப் பாதுகாக்கவும்.

# appInfoSectionTutorial
source: All information about the app is available on the App Info screen. Tap to explore more details.
ta: பயன்பாட்டைப் பற்றிய அனைத்து தகவல்களும் பயன்பாட்டுத் தகவல் திரையில் கிடைக்கின்றன. மேலும் விவரங்களை ஆராய தட்டவும்.

source: Skip
ta: தவிர்
